app/Models/Usuarios.php

SELECT *
FROM `tusuarios`
WHERE `usuario` = 'admin'
---
    public function obtenerUsuarios($data = [])
    {
        $usuario = $this->db->table('tusuarios');
        if (!empty($data)) {
            $usuario->where($data);
        }
        return $usuario->get()->getResultArray();

SELECT `u`.*, `r`.`descripcion` as `rol`
FROM `tusuarios` `u`
JOIN `troles` `r` ON `u`.`id_rol` = `r`.`id_rol`
WHERE `u`.`id_usuario` = '1'
---
    public function obtenerUsuarioConRol($id)
    {
        return $this->db->table('tusuarios u')
                       ->join('troles r', 'u.id_rol = r.id_rol')
                       ->select('u.*, r.descripcion as rol')
                       ->where('u.id_usuario', $id)
                       ->get()
                       ->getRowArray();